<template>
  <v-row>
    <v-col>
      <v-card class="section">
        <h1 class="mb-2" align="center">Справочный Центр</h1>
        <p>
          Наш сервис позволяет легко и удобно создавать, редактировать, печатать и хранить справки в одном
          месте. На сайте пользователи могут добавлять данные для своих справок, проверять их статусы и при
          необходимости вносить изменения. Администраторы могут управлять хранилищем справок, предоставляя
          доступ к нему и следя за состоянием справок всех пользователей.
        </p>

      </v-card>
    </v-col>
  </v-row>
  <h2 align="center">Как это работает?</h2>
  <v-row>
    <v-col >
      <v-card class="section">

        <h3 align="center">Для пользователей:</h3>
        <p>
          Наш сервис предоставляет пользователям простой способ создать и напечатать справку. Всё, что нужно, —
          это заполнить форму, просмотреть результат и при необходимости скорректировать данные.
        </p>
        <ul>
          <li><strong>Авторизация:</strong> Чтобы начать работу, пользователи проходят авторизацию по ссылке, которую
            им прислал администратор.</li>
          <li><strong>Добавление справок:</strong> После авторизации можно заполнить форму, указав необходимые данные
            для справки.</li>
          <li><strong>Предпросмотр и печать справки:</strong> После заполнения формы вы можете посмотреть, как справка
            будет выглядеть в печатном виде. Если всё устраивает, справку можно сразу отправить на печать.</li>
          <li><strong>Редактирование данных:</strong> При необходимости можно отредактировать данные в форме и снова
            просмотреть результат.</li>
          <li><strong>Проверка статуса справок:</strong> Все созданные справки автоматически сохраняются в хранилище.
            Пользователь может в любой момент проверить статус своей справки.</li>
          <li><strong>Вопросы и поддержка:</strong> Если у вас возникли вопросы или проблемы, свяжитесь с
            администратором, который предоставил вам ссылку.</li>
        </ul>
      </v-card>
    </v-col>

    <v-col>
      <v-card class="section">
        <h3 align="center">Для администратора:</h3>
        <p>
          Администратор создаёт хранилище справок и контролирует доступ к нему, отправляя пользователям ссылки
          для авторизации. Администратор может отслеживать статус всех справок в хранилище.
        </p>
        <ul>
          <li><strong>Создание ссылки на хранилище:</strong> Администратор создаёт ссылку на уникальное хранилище
            справок.</li>
          <li><strong>Отправка ссылки пользователям:</strong> После создания ссылки администратор отправляет её нужным
            пользователям.</li>
          <li><strong>Просмотр справок в хранилище:</strong> Администратор имеет доступ к справкам всех пользователей
            и может управлять ими по мере необходимости.</li>
        </ul>
        <div align="center" class="mt-2">
          <RouterLink to="/hub">
            <v-btn size="small"  color="primary" prepend-icon="mdi-folder">Хранилища</v-btn>
          </RouterLink>
        </div>


      </v-card>
    </v-col>
  </v-row>

  <v-row>
    <v-col>
      <v-card class="section">
        <h2>Инструкция по началу работы</h2>
        <p>1. Если вы <strong>Пользователь</strong>, перейдите по ссылке, авторизуйтесь, добавьте данные о справке и
          следите за её статусом.</p>
        <p>2. Если вы <strong>Администратор</strong>, начните с <RouterLink to="/hub/create">создания хранилища
          </RouterLink> и
          отправки ссылки для доступа к
          нему пользователям.</p>
      </v-card>
    </v-col>
  </v-row>

  <v-row>
    <v-col>
      <v-card class="section">
        <h2>Контакты поддержки</h2>
        <p>
          Если у вас возникли вопросы, обращайтесь к администратору, который предоставил вам ссылку, для получения
          помощи и поддержки.
        </p>
      </v-card>
    </v-col>
  </v-row>
</template>

<script>



export default {
  components: {

  }
};
</script>

<style>
.container {
  padding: 20px;
}

.section {
  margin-bottom: 40px;
  border-radius: 8px;
  padding: 20px;
  min-width: 250px;
}

h2 {
  margin-bottom: 20px;
}

.image {
  max-height: 100px;
  height: auto;
  border-radius: 8px;
}
</style>
